X_O = [[" ", " ", " "],[" ", " ", " "],[" ", " ", " "]] #поле


def pole(): #функция вывода поля +++++++++++
       print(f'  0 1 2') #ВЕРХНЯЯ СТРОКА
       for i in range(3): #цикл построчного вывода поля
              stroka = " ".join(X_O[i])
              print(f"{i} {stroka}")


def vvod_koord(): #функия ввода координат
    while True: #цикл ввода координат
        z = input("Введите 2 координаты цифрами, через пробел:").split() #ввод координат
        if len(z) != 2: #проверка количества введенных символов
            print("Введите !2! координаты!")
            continue

        global x, y
        x, y = int(z[0]), int(z[1])


        if 0 <= x <= 2 or 0 <= y <= 2: #проверка "координаты в поле?"
            if X_O[x][y] == " ": #проверка "свободна ли ячейка?"
                return x, y
            else:
                print("клетка занята")
        else:
            print("введенные координаты вне поля")

    return x, y

def win():
    if (X_O[0][0] == "X" and X_O[0][1] == "X" and X_O[0][2] == "X") or \
            (X_O[1][0] == "X" and X_O[1][1] == "X" and X_O[1][2] == "X") or \
            (X_O[2][0] == "X" and X_O[2][1] == "X" and X_O[2][2] == "X") or \
            (X_O[0][0] == "X" and X_O[1][0] == "X" and X_O[2][0] == "X") or \
            (X_O[0][1] == "X" and X_O[1][1] == "X" and X_O[2][1] == "X") or \
            (X_O[0][2] == "X" and X_O[1][2] == "X" and X_O[2][2] == "X") or \
            (X_O[0][2] == "X" and X_O[1][1] == "X" and X_O[2][0] == "X") or \
            (X_O[0][0] == "X" and X_O[1][1] == "X" and X_O[2][2] == "X"):
        print("Победа крестиков")
        return True
    elif (X_O[0][0] == "0" and X_O[0][1] == "0" and X_O[0][2] == "0") or \
            (X_O[1][0] == "0" and X_O[1][1] == "0" and X_O[1][2] == "0") or \
            (X_O[2][0] == "0" and X_O[2][1] == "0" and X_O[2][2] == "0") or \
            (X_O[0][0] == "0" and X_O[1][0] == "0" and X_O[2][0] == "0") or \
            (X_O[0][1] == "0" and X_O[1][1] == "0" and X_O[2][1] == "0") or \
            (X_O[0][2] == "0" and X_O[1][2] == "0" and X_O[2][2] == "0") or \
            (X_O[0][2] == "0" and X_O[1][1] == "0" and X_O[2][0] == "0") or \
            (X_O[0][0] == "0" and X_O[1][1] == "0" and X_O[2][2] == "0"):
        print("Победа ноликов")
        return True

print("Крестики-нолики")
print("---------------")
print("Ход игры: координаты вводятся по очереди через пробел.")
print("Введите сначала номер строки от 0 до 2, затем номер столбца.")
print("---------------")

hod = 0
while True:
       hod += 1
       pole()

       if hod % 2 == 0:
              print("Ходит нолик")
       else:
              print("Ходит крестик")

       vvod_koord()

       if hod % 2 == 0:
              X_O[x][y] = "0"
       else:
              X_O[x][y] = "X"

       if win():
           pole()
           break

       if hod == 9:
              print("Ничья")
              break













#строки:

#    [0][0] [0][1] [0][2]
#    [1][0] [1][1] [1][2]
#    [2][0] [2][1] [2][2]
#столбцы
#    [0][0] [1][0] [2][0]
#    [1][1] [1][1] [2][1]
#    [0][2] [1][2] [2][2]
#диагонали
#    [0][0] [1][1] [2][2]
#    [0][2] [1][1] [2][0]

#строки:
#    (X_O[0][0] == "X" and X_O[0][1] == "X" and X_O[0][2] == "X") or
#    (X_O[1][0] == "X" and X_O[1][1] == "X" and X_O[1][2] == "X") or
#    (X_O[2][0] == "X" and X_O[2][1] == "X" and X_O[2][2] == "X") or
#столбцы
#    (X_O[0][0] == "X" and X_O[1][0] == "X" and X_O[2][0] == "X") or
#    (X_O[1][1] == "X" and X_O[1][1] == "X" and X_O[2][1] == "X") or
#    (X_O[0][2] == "X" and X_O[1][2] == "X" and X_O[2][2] == "X") or
#диагонали
#    (X_O[0][0] == "X" and X_O[1][1] == "X" and X_O[2][2] == "X") or
#    (X_O[0][2] == "X" and X_O[1][1] == "X" and X_O[2][0] == "X")